chore: update diagrams
